tests : dict[str,list[int]] = {
    ("fusion simple":
    [
        2,0,0,0,
        2,0,0,0,
        0,0,0,0,
        0,0,0,0
    ])
    ,("non fusion":
    [
        4,2,0,0,
        0,0,0,0,
        0,0,0,0,
        0,0,0,0
    ])
    ,("non fusion éloignée":
    [
        0,2,0,4,
        0,0,0,0,
        0,0,0,0,
        0,0,0,0
    ])
    ,("fusion éloignée":
    [
        2,0,0,0,
        0,0,0,0,
        0,0,0,0,
        2,0,0,0
    ])
    ,("double fusion":
    [
        0,0,0,2,
        0,0,0,2,
        0,0,0,2,
        0,0,0,2
    ])
    ,("decalage vers le bas":
    [
        0,0,0,2,
        0,0,0,4,
        0,0,0,2,
        0,0,0,0
    ])
    ,("décalage vers la gauche et fusion":
    [
        0,0,0,0,
        0,0,0,0,
        0,0,0,0,
        0,4,2,2
    ])
    }